---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportEnergyModelType.AnalysisMode
enum: Autodesk.Revit.DB.ExportEnergyModelType
source: html/a5e9c660-febe-e1c0-af58-47a55bde5443.htm
---
# Autodesk.Revit.DB.ExportEnergyModelType.AnalysisMode

Energy model based on analysis mode in EnergyDataSettings.